In [1]:
import pandas as pd
import requests
import io

In [2]:
url = 'https://storageamanthan.blob.core.windows.net/uber-de/uber_data.csv?sp=r&st=2024-06-23T13:39:27Z&se=2024-06-25T21:39:27Z&skoid=9cc7895e-7a0e-4f6c-a719-9566a6862ec1&sktid=18bb14fc-3a84-427e-a9aa-2f77c44e0a0a&skt=2024-06-23T13:39:27Z&ske=2024-06-25T21:39:27Z&sks=b&skv=2022-11-02&sv=2022-11-02&sr=b&sig=kRK6OuB%2BNrCbP8NgFMhNeXdZFFHG%2B7fYaxGARhJWN8Y%3D'
response = requests.get(url)

uber_df = pd.read_csv(io.StringIO(response.text), sep=',')
uber_df.to_csv('data/uber_data.csv',index=False)

In [3]:
# uber_df = pd.read_csv('data/uber_data.csv')
uber_df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,2016-03-01 00:00:00,2016-03-01 00:07:55,1,2.50,-73.976746,40.765152,1,N,-74.004265,40.746128,1,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1,2016-03-01 00:00:00,2016-03-01 00:11:06,1,2.90,-73.983482,40.767925,1,N,-74.005943,40.733166,1,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2,2016-03-01 00:00:00,2016-03-01 00:31:06,2,19.98,-73.782021,40.644810,1,N,-73.974541,40.675770,1,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2,2016-03-01 00:00:00,2016-03-01 00:00:00,3,10.78,-73.863419,40.769814,1,N,-73.969650,40.757767,1,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2,2016-03-01 00:00:00,2016-03-01 00:00:00,5,30.43,-73.971741,40.792183,3,N,-74.177170,40.695053,1,98.0,0.0,0.0,0.00,15.50,0.3,113.80

In [106]:
uber_df.columns

Index(['VendorID', 'tpep_pickup_datetime', 'tpep_dropoff_datetime',
       'passenger_count', 'trip_distance', 'pickup_longitude',
       'pickup_latitude', 'RatecodeID', 'store_and_fwd_flag',
       'dropoff_longitude', 'dropoff_latitude', 'payment_type', 'fare_amount',
       'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
       'improvement_surcharge', 'total_amount'],
      dtype='object')

In [107]:
uber_df['tpep_pickup_datetime'] = pd.to_datetime(uber_df['tpep_pickup_datetime'])
uber_df['tpep_dropoff_datetime'] = pd.to_datetime(uber_df['tpep_dropoff_datetime'])

In [108]:
uber_df = uber_df.drop_duplicates().reset_index(drop=True)
uber_df['trip_id'] = uber_df.index + 1

In [109]:
uber_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 20 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               100000 non-null  int64
 1   tpep_pickup_datetime   100000 non-null  datetime64[ns]
 2   tpep_dropoff_datetime  100000 non-null  datetime64[ns]
 3   passenger_count        100000 non-null  int64
 4   trip_distance          100000 non-null  float64
 5   pickup_longitude       100000 non-null  float64
 6   pickup_latitude        100000 non-null  float64
 7   RatecodeID             100000 non-null  int64
 8   store_and_fwd_flag     100000 non-null  object
 9   dropoff_longitude      100000 non-null  float64
 10  dropoff_latitude       100000 non-null  float64
 11  payment_type           100000 non-null  int64
 12  fare_amount            100000 non-null  float64
 13  extra                  100000 non-null  float64
 14  mta_tax                100000 non-null  float64
 15  tip_amount             100000 non-null  float64
 16  tolls_amount           100000 non-null  float64
 17  improvement_surcharge  100000 non-null  float64
 18  total_amount           100000 non-null  float64
 19  trip_id                100000 non-null  int64
dtypes: datetime64[ns](2), float64(12), int64(5), object(1)
memory usage: 15.3+ MB

## Convert Fact table to Dimension table

## 1. Dim_Datetimes

In [110]:
dim_datetimes = uber_df[['tpep_pickup_datetime']].reset_index(drop=True)
dim_datetimes['pick_hour'] = dim_datetimes['tpep_pickup_datetime'].dt.hour
dim_datetimes['pick_day'] = dim_datetimes['tpep_pickup_datetime'].dt.day
dim_datetimes['pick_month'] = dim_datetimes['tpep_pickup_datetime'].dt.month
dim_datetimes['pick_year'] = dim_datetimes['tpep_pickup_datetime'].dt.year
dim_datetimes['pick_weekday'] = dim_datetimes['tpep_pickup_datetime'].dt.weekday


dim_datetimes['tpep_dropoff_datetime'] = uber_df[['tpep_dropoff_datetime']]
dim_datetimes['drop_hour'] = dim_datetimes['tpep_dropoff_datetime'].dt.hour
dim_datetimes['drop_day'] = dim_datetimes['tpep_dropoff_datetime'].dt.day
dim_datetimes['drop_month'] = dim_datetimes['tpep_dropoff_datetime'].dt.month
dim_datetimes['drop_year'] = dim_datetimes['tpep_dropoff_datetime'].dt.year
dim_datetimes['drop_weekday'] = dim_datetimes['tpep_dropoff_datetime'].dt.weekday


dim_datetimes['datetime_id'] = dim_datetimes.index + 1

dim_datetimes = dim_datetimes[[dim_datetimes.columns[-1]] + dim_datetimes.columns[:-1].tolist()]
dim_datetimes

,datetime_id,tpep_pickup_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,tpep_dropoff_datetime,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,1,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:07:55,0,1,3,2016,1
1,2,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:11:06,0,1,3,2016,1
2,3,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:31:06,0,1,3,2016,1
3,4,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:00:00,0,1,3,2016,1
4,5,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:00:00,0,1,3,2016,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,99996,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:22:15,6,1,3,2016,1
99996,99997,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:32:41,6,1,3,2016,1
99997,99998,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:37:23,6,1,3,2016,1
99998,99999,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:22:09,6,1,3,2016,1
99999,100000,2016-03-01 06:17:11,6,1,3,2016,1,2016-03-01 06:22:00,6,1,3,2016,1

## 2. Dim_Passenger_Counts

In [111]:
dim_passenger_counts = uber_df[['passenger_count']].reset_index(drop=True)
dim_passenger_counts['passenger_count_id'] = dim_passenger_counts.index + 1
dim_passenger_counts = dim_passenger_counts[['passenger_count_id', 'passenger_count']]
dim_passenger_counts

       passenger_count_id  passenger_count
0                       1                1
1                       2                1
2                       3                2
3                       4                3
4                       5                5
...                   ...              ...
99995               99996                1
99996               99997                1
99997               99998                1
99998               99999                1
99999              100000                1

[100000 rows x 2 columns]

## 3. Dim_Trip_Distances

In [112]:
dim_trip_distances = uber_df[['trip_distance']].reset_index(drop=True)
dim_trip_distances['trip_distance_id'] = dim_trip_distances.index + 1
dim_trip_distances = dim_trip_distances[['trip_distance_id', 'trip_distance']]
dim_trip_distances

       trip_distance_id  trip_distance
0                     1           2.50
1                     2           2.90
2                     3          19.98
3                     4          10.78
4                     5          30.43
...                 ...            ...
99995             99996           0.50
99996             99997           3.40
99997             99998           9.70
99998             99999           0.92
99999            100000           1.00

[100000 rows x 2 columns]

## 4. Dim_Rate_Codes

In [113]:
rate_code_type = {
    1:"Standard rate",
    2:"JFK",
    3:"Newark",
    4:"Nassau or Westchester",
    5:"Negotiated fare",
    6:"Group ride"
}

dim_rate_codes = uber_df[['RatecodeID']].reset_index(drop=True)
dim_rate_codes['rate_code_id'] = dim_rate_codes.index + 1
dim_rate_codes['name'] = dim_rate_codes['RatecodeID'].map(rate_code_type)
dim_rate_codes = dim_rate_codes[['rate_code_id', 'name']]
dim_rate_codes

       rate_code_id           name
0                 1  Standard rate
1                 2  Standard rate
2                 3  Standard rate
3                 4  Standard rate
4                 5         Newark
...             ...            ...
99995         99996  Standard rate
99996         99997  Standard rate
99997         99998  Standard rate
99998         99999  Standard rate
99999        100000  Standard rate

[100000 rows x 2 columns]

## 5. Dim_Pickup_Locations

In [114]:
dim_pickup_locations = uber_df[['pickup_longitude', 'pickup_latitude']].reset_index(drop=True)
dim_pickup_locations['pickup_location_id'] = dim_pickup_locations.index + 1
dim_pickup_locations = dim_pickup_locations[['pickup_location_id', 'pickup_latitude', 'pickup_longitude']]
dim_pickup_locations

       pickup_location_id  pickup_latitude  pickup_longitude
0                       1        40.765152        -73.976746
1                       2        40.767925        -73.983482
2                       3        40.644810        -73.782021
3                       4        40.769814        -73.863419
4                       5        40.792183        -73.971741
...                   ...              ...               ...
99995               99996        40.750519        -73.990898
99996               99997        40.718296        -74.014488
99997               99998        40.774097        -73.963379
99998               99999        40.763111        -73.984901
99999              100000        40.750473        -73.990685

[100000 rows x 3 columns]

## 6. Dim_Drop_Locations

In [115]:
dim_drop_locations = uber_df[['dropoff_longitude', 'dropoff_latitude']].reset_index(drop=True)
dim_drop_locations['drop_location_id'] = dim_drop_locations.index + 1
dim_drop_locations = dim_drop_locations[['drop_location_id', 'dropoff_latitude', 'dropoff_longitude']]
dim_drop_locations

       drop_location_id  dropoff_latitude  dropoff_longitude
0                     1         40.746128         -74.004265
1                     2         40.733166         -74.005943
2                     3         40.675770         -73.974541
3                     4         40.757767         -73.969650
4                     5         40.695053         -74.177170
...                 ...               ...                ...
99995             99996         40.750462         -73.998245
99996             99997         40.752529         -73.982361
99997             99998         40.770512         -73.865028
99998             99999         40.759148         -73.970695
99999            100000         40.754910         -73.980354

[100000 rows x 3 columns]

## 7. Dim_Payment_Types

In [116]:
payment_type_name = {
    1:"Credit card",
    2:"Cash",
    3:"No charge",
    4:"Dispute",
    5:"Unknown",
    6:"Voided trip"
}

dim_payment_types = uber_df[['payment_type']].reset_index(drop=True)
dim_payment_types['payment_type_id'] = dim_payment_types.index + 1
dim_payment_types['payment_type'] = dim_payment_types['payment_type'].map(payment_type_name)
dim_payment_types = dim_payment_types[['payment_type_id', 'payment_type']]
dim_payment_types

       payment_type_id payment_type
0                    1  Credit card
1                    2  Credit card
2                    3  Credit card
3                    4  Credit card
4                    5  Credit card
...                ...          ...
99995            99996         Cash
99996            99997  Credit card
99997            99998  Credit card
99998            99999  Credit card
99999           100000         Cash

[100000 rows x 2 columns]

## ~>(Final) Fact Table Creation

In [121]:
uber_fact_table = uber_df.merge(dim_datetimes, left_on='trip_id', right_on='datetime_id') \
                    .merge(dim_drop_locations, left_on='trip_id', right_on='drop_location_id') \
                    .merge(dim_passenger_counts, left_on='trip_id', right_on='passenger_count_id') \
                    .merge(dim_payment_types, left_on='trip_id', right_on='payment_type_id') \
                    .merge(dim_pickup_locations, left_on='trip_id', right_on='pickup_location_id') \
                    .merge(dim_rate_codes, left_on='trip_id', right_on='rate_code_id') \
                    .merge(dim_trip_distances, left_on='trip_id', right_on='trip_distance_id') \
                    [['trip_id','VendorID', 'datetime_id', 'passenger_count_id',
                       'trip_distance_id', 'rate_code_id', 'store_and_fwd_flag', 'pickup_location_id', 'drop_location_id',
                       'payment_type_id', 'fare_amount', 'extra', 'mta_tax', 'tip_amount', 'tolls_amount',
                       'improvement_surcharge', 'total_amount'
                     ]]
uber_fact_table

,trip_id,VendorID,datetime_id,passenger_count_id,trip_distance_id,rate_code_id,store_and_fwd_flag,pickup_location_id,drop_location_id,payment_type_id,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,1,1,1,1,1,N,1,1,1,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,2,1,2,2,2,2,N,2,2,2,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,3,2,3,3,3,3,N,3,3,3,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,4,2,4,4,4,4,N,4,4,4,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,5,2,5,5,5,5,N,5,5,5,98.0,0.0,0.0,0.00,15.50,0.3,113.80
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99995,99996,1,99996,99996,99996,99996,N,99996,99996,99996,5.0,0.0,0.5,0.00,0.00,0.3,5.80
99996,99997,1,99997,99997,99997,99997,N,99997,99997,99997,14.0,0.0,0.5,2.00,0.00,0.3,16.80
99997,99998,1,99998,99998,99998,99998,N,99998,99998,99998,29.0,0.0,0.5,8.80,5.54,0.3,44.14
99998,99999,2,99999,99999,99999,99999,N,99999,99999,99999,5.5,0.5,0.5,1.36,0.00,0.3,8.16
99999,100000,1,100000,100000,100000,100000,N,100000,100000,100000,6.0,0.0,0.5,0.00,0.00,0.3,6.80

# Uber Data Analytics | Modern Data Engineering with Azure



[PowerBI]:https://powerbi.microsoft.com/en-us/
[R]:https://www.r-project.org/
[vscode]:https://code.visualstudio.com/
[jupyter]:https://jupyter.org/
[mage-ai]:https://www.mage.ai/
[azure storage account]:https://learn.microsoft.com/en-us/azure/storage/blobs/storage-blobs-introduction/dr